<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"14d50fcbe30b5ff5a141147188b6ad280595fbd7835a1395d1214c3102c630ae","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #573 at https://github.com/cal-itp/data-infra/actions/runs/17588051478","plan_out_hash":"f0d58f5f5d087e82bebe950f66cbf9d447b1cc0dbfc9a05a6bf1812a46ee9203","plan_hash":"7c0dd05555832b5f918caf6005c64dbc14395dadf72009a3d2d7e05892eaa9f3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/scrape_ntd_xlsx.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "3lHrkQ==" -> (known after apply)
!~      detect_md5hash      = "n5buwLrUiAM5+k8Tp+ZhWQ==" -> "different hash"
!~      generation          = 1751416674405014 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/scrape_ntd_xlsx.py"
!~      md5hash             = "n5buwLrUiAM5+k8Tp+ZhWQ==" -> (known after apply)
        name                = "plugins/operators/scrape_ntd_xlsx.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #573](https://github.com/cal-itp/data-infra/actions/runs/17588051478)